# ========================================================
# ==               ./Brewfile                           ==
# ==                                                    ==
# ==  This Brewfile is built to be used with the Helix  ==
# ==  AI development environment.                       ==
# ==  Copyright (c) 2020 SinLess Games LLC              ==
# ==                                                    ==
# ========================================================

# ========================================================
# ==                                                    ==
# ==                Taps and Sources                    ==
# ==                                                    ==
# ========================================================

tap 'homebrew/bundle'          # Manage dependencies using Brewfiles.
tap 'homebrew/core'            # Access to the main Homebrew formulae repository.
tap 'homebrew/services'        # Start, stop, and manage background services via Homebrew.
tap 'homebrew/cask'            # Install GUI applications and utilities.
tap 'devopsdays/tap'           # Access DevOpsDays tools and plugins.
tap 'heroku/brew'              # Install the Heroku CLI for managing Heroku apps.
tap 'sass/sass'                # Use Sass, a CSS preprocessor, for styling.
tap 'teamookla/speedtest'      # Use the Speedtest CLI for network speed diagnostics.
tap 'romkatv/powerlevel10k'    # Install the Powerlevel10k theme for a customizable Zsh prompt.
tap 'hashicorp/tap'            # HashiCorp tools like Terraform and Vault.

# ========================================================
# ==                                                    ==
# ==                Command-Line Tools                  ==
# ==                                                    ==
# ========================================================

# === Essential Development Tools ===
brew 'terraform'               # Infrastructure as Code (IaC) tool for managing cloud resources.
brew  'hashicorp/tap/packer'   # Tool for creating machine images for multiple platforms from a single source configuration.
brew 'awscli'                  # Official Amazon Web Services CLI for managing AWS resources.
brew 'azure-cli'               # Official Azure CLI for managing Microsoft Azure resources.
brew 'kubernetes-cli'          # Command-line tool to interact with Kubernetes clusters.
brew 'docker'                  # Platform for developing, shipping, and running containerized applications.
brew 'kubectl'                 # Kubernetes command-line tool for cluster management.
brew 'helm'                    # Kubernetes package manager for deploying and managing applications.

# === Basics ===
brew 'fzf'                     # Command-line fuzzy finder for files, history, and more.
brew 'lsd'                     # Enhanced file listing with colors and icons (replaces `ls`).
brew 'diff-so-fancy'           # Improved diff output for better readability.
brew 'zsh-autosuggestions'     # Zsh plugin for command suggestions.
brew 'zsh-syntax-highlighting' # Syntax highlighting for the Zsh shell.
brew 'direnv'                  # Environment switcher for loading project-specific environments.

# === Monitoring and Performance ===
brew 'gping'                   # Graphically enhanced ping tool for network diagnostics.

# === Productivity ===
brew 'jq'                      # Command-line JSON processor.
brew 'yq'                      # Command-line YAML processor.

# === Security and Encryption ===
brew 'bcrypt'                  # Encryption utility using the Blowfish algorithm.
brew 'openssl'                 # Cryptography and SSL/TLS toolkit for secure communications.
brew 'gnupg'                   # OpenPGP encryption and signing tool for securing files and communications.
brew 'sops'                    # Tool for managing secrets encrypted in various formats.
brew 'age'                     # Simple, modern, and secure file encryption tool.

# === Text Processing ===
brew 'powerline-go'            # Patched fonts for Powerline, a statusline plugin for Vim.

# ========================================================
# ==                                                    ==
# ==                  Development Tools                 ==
# ==                                                    ==
# ========================================================

# === Development Languages and SDKs ===
brew 'python'                  # Python programming language.
brew 'go'                      # Go programming language and compiler.
brew 'nvm'                     # Node Version Manager to manage multiple Node.js versions.
brew "gcc"                     # GNU Compiler Collection for C, C++, and Fortran.

# === Development Utilities ===
brew 'git'                     # Version control system to track changes in source code.
brew 'git-extras'              # Additional Git utilities like Git commits and rebasing.
brew 'gh'                      # GitHub CLI for managing GitHub repositories.
brew 'git-flow'                # Git extensions to provide high-level repository operations.
brew 'wget'                    # Command-line utility for downloading files from the web.
brew 'hub'                     # GitHub tool for the command-line to simplify GitHub interactions.
brew 'go-task'                 # Task management tool for terminal-based task tracking.
