# ========================================================
# ==               ./Brewfile                           ==
# ==                                                    ==
# ==  This Brewfile is built to be used with the Helix  ==
# ==  AI development environment.                       ==
# ==  Copyright (c) 2020 SinLess Games LLC              ==
# ==                                                    ==
# ========================================================

# ========================================================
# ==                                                    ==
# ==                Taps and Sources                    ==
# ==                                                    ==
# ========================================================

tap 'homebrew/bundle'          # Manage dependencies using Brewfiles.
tap 'homebrew/core'            # Access to the main Homebrew formulae repository.
tap 'homebrew/services'        # Start, stop, and manage background services via Homebrew.
tap 'homebrew/cask'            # Install GUI applications and utilities.
tap 'devopsdays/tap'           # Access DevOpsDays tools and plugins.
tap 'heroku/brew'              # Install the Heroku CLI for managing Heroku apps.
tap 'sass/sass'                # Use Sass, a CSS preprocessor, for styling.
tap 'teamookla/speedtest'      # Use the Speedtest CLI for network speed diagnostics.
tap 'romkatv/powerlevel10k'    # Install the Powerlevel10k theme for a customizable Zsh prompt.
tap 'hashicorp/tap'            # HashiCorp tools like Terraform and Vault.

# ========================================================
# ==                                                    ==
# ==                Command-Line Tools                  ==
# ==                                                    ==
# ========================================================

# === Essential Development Tools ===
brew 'terraform'               # Infrastructure as Code (IaC) tool for managing cloud resources.
brew 'awscli'                  # Official Amazon Web Services CLI for managing AWS resources.
brew 'azure-cli'               # Official Azure CLI for managing Microsoft Azure resources.
brew 'kubernetes-cli'          # Command-line tool to interact with Kubernetes clusters.
brew 'docker'                  # Platform for developing, shipping, and running containerized applications.
brew 'kubectl'                 # Kubernetes command-line tool for cluster management.
brew 'helm'                    # Kubernetes package manager for deploying and managing applications.

# === Basics ===
brew 'thefuck'                 # Correct misspelled commands in the terminal.
brew 'fzf'                     # Command-line fuzzy finder for files, history, and more.
brew 'lsd'                     # Enhanced file listing with colors and icons (replaces `ls`).
brew 'diff-so-fancy'           # Improved diff output for better readability.
brew 'bat'                     # A cat clone with syntax highlighting for code.
brew 'zsh-autosuggestions'     # Zsh plugin for command suggestions.
brew 'zsh-syntax-highlighting' # Syntax highlighting for the Zsh shell.
brew 'direnv'                  # Environment switcher for loading project-specific environments.

# === Monitoring and Performance ===
brew 'gping'                   # Graphically enhanced ping tool for network diagnostics.
brew 'speedtest-cli'           # Run Speedtest.net from the command line to measure internet speed.
brew 'htop'                    # Interactive process viewer (better than `top`).
brew 'glances'                 # Comprehensive system monitoring tool.
brew 'ctop'                    # Real-time container monitoring for Docker and Kubernetes.

# === Productivity ===
brew 'autojump'                # Quickly navigate the filesystem based on usage.
brew 'tree'                    # Display directory tree in the terminal.
brew 'jq'                      # Command-line JSON processor.
brew 'tldr'                    # Community-driven man pages with simplified examples.
brew 'watch'                   # Periodically execute commands and display the output.

# === Security and Encryption ===
brew 'bcrypt'                  # Encryption utility using the Blowfish algorithm.
brew 'openssl'                 # Cryptography and SSL/TLS toolkit for secure communications.
brew 'gnupg'                   # OpenPGP encryption and signing tool for securing files and communications.
brew 'sops'                    # Tool for managing secrets encrypted in various formats.
brew 'age'                     # Simple, modern, and secure file encryption tool.

# === Text Processing ===
brew 'powerline-go'            # Patched fonts for Powerline, a statusline plugin for Vim.

# ========================================================
# ==                                                    ==
# ==                  Development Tools                 ==
# ==                                                    ==
# ========================================================

# === Development Languages and SDKs ===
brew 'python'                  # Python programming language.
brew 'go'                      # Go programming language and compiler.
brew 'node'                    # Node.js runtime for server-side JavaScript.
brew 'nvm'                     # Node Version Manager to manage multiple Node.js versions.
brew 'openjdk'                 # Java Development Kit (JDK) for Java development.
brew "gcc"                     # GNU Compiler Collection for C, C++, and Fortran.

# === Development Utilities ===
brew 'git'                     # Version control system to track changes in source code.
brew 'git-extras'              # Additional Git utilities like Git commits and rebasing.
brew 'gh'                      # GitHub CLI for managing GitHub repositories.
brew 'neovim'                  # Improved Vim text editor for code development.
brew 'vim'                     # Classic Vim text editor.
brew 'wget'                    # Command-line utility for downloading files from the web.
brew 'hub'                     # GitHub tool for the command-line to simplify GitHub interactions.
brew 'scrcpy'                  # Display and control Android devices.
brew 'lazygit'                 # Simple terminal UI for Git commands.
brew 'lazydocker'              # Simple terminal UI for managing Docker containers.
brew 'just'                    # Task runner for running commands in a project.
brew 'task'                    # Task management tool for terminal-based task tracking.

# === Network Tools ===
brew 'ngrok'                   # Secure tunnels to localhost for testing webhooks.
brew 'tmate'                   # Share terminal sessions over the internet for remote collaboration.
brew 'asciinema'               # Record and share terminal sessions.
